{"dimension": 384, "total_documents": 100, "document_texts": ["Nasdaq planning \\$100m-share sale The owner of the Nasdaq index, an icon of the internet boom, is planning to sell \\$100m of shares to the public and list itself on the market it operates.", "Report urges shuttle mission to service Hubble WASHINGTON: An expert panel on Wednesday recommended sending a manned shuttle mission to repair the aging Hubble Space Telescope, instead of the robotic mission NASA had envisioned.", "Update 5: Euro Reaches New High Against US Dollar The US dollar fell to another new low against the euro Friday, pushing the European currency higher than \\$1.34 after US employment data came in weaker than expected.", "Franz wins downhill, Guay 13th VAL D #39;ISERE, France (Ticker) -- Blood, sweat and tears finally paid off for Austrian veteran Werner Franz, who on Saturday collected the very first World Cup downhill win of his 14-year career.", "Creative plans US\\$100m advertising campaign for its MP3 players Creative Chairman and CEO Sim Wong Hoo is aiming for a 40 percent share of the global market for MP3 players next year. To achieve its target, the Singapore-based company will ", "Oracle to nominate four candidates for PeopleSoft board REDWOOD SHORES, Calif. Oracle has announced plans to nominate four candidates for election to rival PeopleSoft #39;s board of directors.", "Israel Hints at Military Action Vs. Syria (AP) AP - Israel ratcheted up its rhetoric against Syria on Thursday, hinting of possible military action following this week's deadly suicide bombing in southern Israel.", "Delta clips its wings in Dallas The links between Delta Air Lines and Dallas reach all the way back to the carrier #39;s first passenger flight. On June 17, 1929, a six-seat Delta  quot;Travelair quot; flew from Dallas to Jackson, Miss.", "Stocks Unchanged, Intel Weighs on Nasdaq  NEW YORK (Reuters) - U.S. stocks were little changed on  Tuesday as a sharp drop in consumer confidence in August  stirred fresh doubt about the economy and expectations for  Intel to pull in its quarterly revenue forecast weighed on  technology stocks.", "Saudi call for jihad A group of Saudi religious scholars have signed an open letter urging Iraqis to support jihad against US-led forces.  quot;Fighting the occupiers is a duty for all those who are able, quot; they said in a statement posted on the internet at the weekend.", "Fed Raises Rates for Third Time This Year  WASHINGTON (Reuters) - The U.S. Federal Reserve on Tuesday  raised interest rates for the third time this year by a quarter  of a percentage point and said the economy was regaining  momentum, signaling at least one more to come.", "Late Bogies Hurt Woods at Rainy NEC Invitational  AKRON, Ohio, Aug 19 (Reuters) - Tiger Woods returned to  form at one of his favorite venues before a pair of dropped  shots cost him a share of the lead at the weather-affected  WGC-NEC Invitational on Thursday.", "Gannon Sidelined with Fractured Vertebrae  ALAMEDA, Calif. (Sports Network) - Oakland Raiders  quarterback Rich Gannon is expected to be sidelined for at  least six weeks after sustaining fractured vertebrae in his  neck.", "Kudos to Microsoft for Dual-Core Chip Plans Opinion: The company #39;s decision to keep per-processor licensing for upcoming multicore technology is a win for customers, but of more immediate licensing concern are grid, partitioning and utility computing.", "Newcastle sack manager Robson Newcastle United Football Club has sacked Sir Bobby Robson, the oldest manager in the English Premier League.  quot;After a disappointing start to the Premier League season, the directors of Newcastle United have ", "Clarett Implicates Tressel, Ohio State In this week #39;s issue of ESPN The Magazine, controversial running back Maurice Clarett attempts to perform damage control with NFL owners and general managers concerning his image as the 2005 NFL Draft looms on the horizon.", "Lions Gate deal a Marvel (Variety) Variety - Lions Gate Films Intl. has inked to sell foreign distribution rights to the Marvel/Lions Gate slate of animated made-for-DVD features.", "Singapore: Arafat #39;s death chance for peace Singapore hopes President Yasser Arafat #39;s death will be  quot;an opportunity for a lasting, just and peaceful solution to the Arab-Israeli issue, quot; a spokesman said.", "Lions prepare for Vick, Falcons While many of his Detroit Lions teammates spent the bye weekend at home with their families, Harrington stayed in town to see his brother play college football.", "Sox will fight to the finish for division Maybe this is all you need to know about the determination on Yawkey Way to overtake the Yankees in the American League East: Nearly a month before the regular season ends, Red Sox starters were told to prepare to wage an all-out effort in the four-game series that ends the season in Baltimore.", "Hollinger report filed in court TORONTO -- A special committee of Hollinger International, which was instrumental in ousting Conrad Black as head of the Chicago-based newspaper company, filed its final report in an Illinois court yesterday.", "Sun Micro Revises Net Down -Filing Network computer maker Sun Microsystems Inc. revised its most recently reported quarterly results slightly lower due to the finalized legal settlement with Microsoft Corp.", "Asia Stocks, Oil Rise; Dollar Firm (Reuters) Reuters - Asian stocks were mostly higher on\\Monday, led by electronics and telecoms firms, while oil\\extended gains and the dollar edged up ahead of an expected\\U.S. Federal Reserve interest rate rise on Tuesday.", "Soaring oil 'hits world economy' The soaring cost of oil hits global economic growth, although recovery is not a distant prospect, according to the OECD.", "Nash, others look good in their new digs American novelist Thomas Wolfe once wrote a book entitled  quot;You Can #39;t Go Home Again. quot; His argument was that once the door to an era closes, it could never be opened again.", "Pen Trick on Bike Locks Could Cost Firms Millions on Friday sought a recall of many U-shaped locks after word spread that an ordinary pen could pick what had been thought to be some of the toughest locks.", "Microsoft Releases Systems Management Server 2003 SP1 Microsoft released its first service pack for Systems Management Server 2003 with support for Windows XP SP2 and Virtual Server 2005.", "September Retail Sales Up by 1.5 Percent The rise in retail sales was the best showing since March. Also, producer prices rose 0.1 percent in September.", "Oil Troublesome Says a Fed President  WASHINGTON (Reuters) - Record oil prices are creating  headwinds for the U.S. economy but do not place its recovery at  risk, Dallas Federal Reserve Bank President Robert McTeer said  on Monday.", "Jaguar and Ford Pull Out of Formula One  LONDON (Reuters) - Jaguar will pull out of Formula One at  the end of 2004, with parent company Ford's engine maker  Cosworth also up for sale.", "Bird Bounces Monarchs Nursing a repaired nose, Sue Bird has 10 points and 14 assists to lead the Seattle Storm to the WNBA finals with an 82-62 win over the Sacramento Monarchs on Tuesday.", "Bank of England policymakers meet; no change seen on interest rates (AFP) AFP - The Bank of England's rate-setting Monetary Policy Committee (MPC) began its two-day monthly meeting amid broad expectation that interest rates will be left unchanged due to signs of economic slowdown.", "Supermarket chain Morrison sells 114 stores (AFP) AFP - William Morrison, the fourth largest grocery chain, said it had agreed to sell 114 stores to rival Somerfield for 260 million pounds.", "Bush Mocks Kerry for 'Changing Positions' on Iraq (Reuters) Reuters - President Bush on Monday\\mocked his Democratic rival John Kerry for shifting his\\positions on Iraq so many times he could \"debate himself\" in\\this week's face-off between the two candidates.", "Ichiro Raps Five Hits The hits just keep on comin' for Ichiro Suzuki. Suzuki collects five hits in the Mariners' 7-3 victory over the Angels on Saturday night, pulling him 14 hits shy of the season record of 257.", "Sport #39;s hottest property, a collapsed trial, and the seedy world &lt;b&gt;...&lt;/b&gt; When the football agent Paul Stretford hid a camera behind a hotel coffee-machine before a business meeting last year, he planned to reveal a campaign of bullying and blackmail ", "Rock-Tenn to Close Minn. Plant Rock-Tenn Co. on Friday said it will shutter its St. Paul, Minn., folding carton plant in December, which will eliminate jobs and result in financial charges.", "HYDROGEN MILESTONE Turning water into hydrogen energy... A major R  amp; D milestone could help the nation advance toward a clean hydrogen economy. It #39;s a project the INEEL and a Salt Lake ceramics company are collaborating on, using ", "Prince Harry: The Prince and the Paparazzi Henry Charles Albert David (that #39;s Sir to you, and Harry to the press) is a very angry young man. He has been hunted down by a new breed of press photographer and riled by accusations of cheating in his A-levels.", "Siemens adds Flash-OFDM to broadband wireless family German engineering and manufacturing company Siemens will add more broadband technology to its growing portfolio of new high-speed wireless systems slated for delivery early next year.", "The Talk Shows  &lt;em&gt;  Guests to be interviewed today on major television talk shows:&lt;/em&gt;", "Diamondbacks Fire Backman After Four Days (AP) AP - After just four days on the job, Wally Backman was fired Friday as manager of the Arizona Diamondbacks because of two arrests and financial problems he kept from the team.", "Rwandans hope Darfur presence will halt violence EL FASHER, Sudan -- As the sun set over this desert camp, Private Lambert Sendegeya, an African Union soldier from Rwanda, popped in a tape of music from his country and launched into a series of leg bends. Lieutenant Eugene Ruzianda peered from his canvas tent and, removing his green beret, joined the evening exercises.", "Salmond in fishing policy demand Alex Salmond is to deliver a petition calling on the UK to withdraw from the Common Fisheries Policy.", "Circuit City Sales Trail Estimates (Reuters) Reuters - Circuit City Stores Inc.  on\\Tuesday reported a 2.9 percent gain in quarterly same-store\\sales but its growth lagged estimates due to a calendar shift\\and reduced spending through August.", "MARKET AS UNRELIABLE AS THE POLLS THIS past week will go down as one of the most shocking in the annals of modern American history - a once-in-a generation election, when the most powerful and prescient prognosticator known to man, got it all wrong.", "NHL Lockout a Virtual Certainty Thursday (AP) AP - Wade Redden took off his practice gear unsure of when he'd have a chance to put it on again. His injured shoulder wouldn't allow him to play for Canada in the World Cup of Hockey championship on Tuesday night. The lack of a collective bargaining agreement between NHL players and owners figures to keep the Ottawa defenseman off the ice much longer.", "Spike in oil prices will impact on US economy: Fed official A senior US Federal Reserve official said Thursday the recent spike in oil prices would almost certainly impact on the US economy, although it may not be as significant as the shocks of the 1970s and 1980s.", "Philippines Rushes Relief to Flooded Areas  GENERAL NAKAR, Philippines (Reuters) - Philippine troops  rushed food and drinking water by foot and helicopters on  Sunday to areas cut off by four storms that left more than  1,300 people dead or missing as residents scrambled to flee the  region.", "IBM to Buy Content Management Developer Venetica IBM on Thursday agreed to acquire Venetica Corp., a maker of content integration software that allows enterprises to access and embed unstructured data including business documents, e-mail, digital media, still images, and Web pages.", "Greenberg son  #39;to stand down at Marsh #39; Jeffrey Greenberg, the chief executive of Marsh  amp; McLennan, the insurance broker accused of rigging the market to make inappropriate fees from customers, was yesterday expected ", "28,000 lives may be about to change ALEXANDRIA, Va. -- Sitting at the front of US Bankruptcy Court, surrounded by US Airways #39; managers and high-priced lawyers, Chief Executive Officer Bruce Lakefield looked nervous, almost embarrassed.", "Woods looks like he #39;ll stay No. 1 _ for now Stewart Cink was atop the leaderboard, and David Toms had the lead in the clubhouse. But with only 24 players completing second-round play in the rain-delayed NEC Invitational, it was hard to tell who had control. ", "Afghanistan Death Toll in 2004 Up to 957 KANDAHAR, Afghanistan - The killing in Afghanistan spirals onward, undermining U.S. claims of success in pacifying the country with less than a week to go before an historic experiment with democracy - direct presidential elections...", "Payments for retirees  #39;will strain US economy #39; WASHINGTON: An ageing US population will strain public finances and hurt the economy without swift fixes to the social safety net, such as raising the age for full retirement benefits, Federal Reserve Chairman Alan Greenspan said yesterday.", "Behind Enemy Lines: Advice From a Partisan A Republican on how to survive in a Democratic town: This really is the greatest city in the world, but you are now behind enemy lines.", "Intel updates Itanium 2 line Intel on Monday updated its Itanium 2 processors, adding a top-end model to a high-end family designed to displace chips from Sun Microsystems and IBM.", "Cazenove in JP Morgan deal Cazenove and JP Morgan Chase have unveiled a joint venture that effectively ends 181 years of independence for the UK stockbroker and gives a big boost to the US investment bank #39;s UK presence.", "Microsoft warns of 22 new security flaws The goal now is to \"guess what the criminals are going to attack,\" an exec says. Redmond will focus first on the critical flaws.", "Reading Sharon #39;s Mind In a much-noted speech last week, Israels Prime Minister Ariel Sharon ostensibly made a dramatic reversal in course. But I am wondering whether to take his shift at face value.", "A wary sense of relief in Athens ATHENS At the end of the first week of the Olympic Games, security officials are generally pleased, even surprised, by the calm so far, though they caution that a safe opening ceremony and first week may encourage a laxness that could yet give terrorists ", "India #39;s  #39;most wanted #39; killed in gun battle A bandit who killed more than 100 people and kidnapped a film star has been shot dead by police in India. Koose Muniswamy Veerappan, who some considered a Robin Hood for his distribution of money, died in a gun fight on his way to the doctors.", "US Forces Bomb Iraq's Falluja, Seize Zarqawi Aide  FALLUJA, Iraq (Reuters) - U.S. planes bombed targets in  Iraq's rebel-held city of Falluja, killing two people, and the  U.S. military said it had captured a lieutenant of its  deadliest Islamist enemy in Iraq in a raid early on Saturday.", "Microsoft Puts Fingerprint Readers Into Hardware  SEATTLE (Reuters) - Microsoft Corp. &lt;A HREF=\"http://www.reuters.co.uk/financeQuoteLookup.jhtml?ticker=MSFT.O qtype=sym infotype=info qcat=news\"&gt;MSFT.O&lt;/A&gt; on Wednesday  unveiled a new array of keyboard and mice, with some featuring  built-in fingerprint readers to make it easier for users to log  on to personal computers and Web sites.", "Linear Technology charts CEO transition Integrated circuits maker Linear Technology Corp., of Milpitas, says Bob Swanson will give up the title of chief executive officer after 23 years, shifting to a new role as executive chairman.", "Coyotes Juggle Centers The Phoenix Coyotes signed free-agent center Petr Nedved and traded center Daymond Langkow to the Calgary Flames for two players on Thursday.", "Iran says to fulfill uranium suspension as scheduled: spokesman Iran said on Sunday that it would fulfill its commitment of suspending uranium enrichment activities on Monday, denying the allegation that it was still producing uranium feedstuff for enrichment.", "Mediacom Taps Sprint to Provide VoIP Mediacom Communications says it will launch VoIP telephone service in selected markets in the first half of 2005 in partnership with Sprint.", "Sirius Names Karmazin CEO, Shares Jump (Reuters) Reuters - Sirius Satellite Radio Inc.\\ on Thursday named former Viacom Inc. President Mel\\Karmazin as its chief executive, in the latest migration of a\\mainstream radio heavyweight to the fledgling satellite\\industry.", "Aid to Palestinians Approved President Bush  approved Wednesday \\$20 million in direct aid to the Palestinian Authority, as part of a broader White House strategy to pursue peace in the Middle East following Yasser Arafat's death.", "Juninho tries on Larsson #39;s No 7 shirt For a small man, he looks as though he will wear it lightly. No sooner had Juninho completed his protracted move from Middlsbrough to Celtic - he has signed a two-year contract, subject to ", "Vegas-based Primaris in deal with Boeing A Las Vegas-based startup air carrier plans to be the US launch customer for Boeing Co. #39;s new 7E7  quot;Dreamliner quot; twin-engine jet.", "Karzai leading in Afghanistan elections Early returns Friday from Afghanistan #39;s first presidential election put incumbent President Hamid Karzai in the lead, the Financial Times reported Friday.", "Blast at Egyptian Resort Kills at Least 20 A massive explosion tore off the front of a seaside hotel in the Egyptian resort of Taba late Thursday, killing at least 20 people and injuring more than 100 in what appeared to be a terrorist attack aimed at Israeli tourists, officials said.", "Vatican Set to Beatify Gibson #39;s Passionate Muse Pope John Paul II on Sunday will beatify Sister Anne Catherine Emmerich, a sickly 19th century nun who claimed to have visions that gave her courtside seats at Jesus #39; execution.", "'Che's Trail' in Bolivia Traces Guevara's Demise &lt;p&gt;&lt;/p&gt;&lt;p&gt; LA PAZ, Bolivia (Reuters) - Tourists and political pilgrimscan now follow \"Che's trail\" in Bolivia, which traces ErnestoGuevara's fatal attempt to export the Cuban revolution to oneof Latin America's poorest countries.&lt;/p&gt;", "Filmmaker #39;s Murder May Spell End of Dutch Tolerance Dutch police have apprehended eight suspects (all young Moroccans and Algerians) in the killing of filmmaker Theo Van Gogh (yes, he is related) on Tuesday morning outside his flat in Amsterdam, an act which horrified Dutch citizens.", "Broadband offers magical journey A 'magic carpet' to take children around the world is one of the projects that has won a community net award.", "Chamber sues SEC over board rule WASHINGTON (CBS.MW) -- The US Chamber of Commerce filed a lawsuit Thursday against the Securities and Exchange Commission, seeking to overturn a rule requiring mutual funds #39; boards of directors to have independent chairs.", "Hamm Goes for More Gold Amid Controversy Despite the controversy surrounding his gold medal in the all-around, Paul Hamm has a chance to win two more golds Sunday. The American will compete in the finals of the pommel ", "Russia #39;s Yukos oil giant still faces tax woes MOSCOW : Russia #39;s justice ministry said that Yukos had paid three-quarters of its 2000 tax bill but still had billions more in outstanding debts that analysts said would require sales of its assets.", "UK bankers may face US trial over Enron Three British ex-bankers are to appeal a decision by a judge that they could be extradited to the United States to face trial over alleged fraud charges relating to disgraced energy group Enron.", "SGI supercomputer: Two records in one day The public record has been eclipsed by a faster result yet to be announced, CNET News.com has learned.", "Netscape aims beyond Firefox com November 17, 2004, 5:02 PM PT. This priority retains its ranking at number five as more and more companies deploy Web services to share business logic, data and processes with each other and with clients.", "AOL to give away McAfee to members America Online Inc is bundling antivirus software from McAfee Inc into version 9.0 Security Edition of its online service, providing blanket virus blocking coverage for its approximately 23 million paying subscribers.", "New Microsoft set-top box ready to roll Though MSN TV2 is the successor to the original WebTV devices, the new box is a vast departure from its predecessors.", "Into the abyss Where freedom was promised, chaos and carnage now reign. A suicide bomber in a car blows himself up in the heart of Baghdad killing 13 people.", "Eastman Kodak raises annual sales forecasts for digital products Eastman Kodak Co., in the midst of its strengthening its position in digital imaging, said Wednesday it expects sales of digital products and services to increase by about 36 per cent between 2003 and 2007.", "Update 1: Camden Property to Buy Summit Properties Camden Property Trust has agreed to buy Summit Properties Inc., a rival owner of upscale apartments, for about \\$1.1 billion. The two real-estate investment trusts Monday said the merger creates the country #39;s ", "6 Killed in Crash of British Train A high-speed passenger train ploughed into a car at a level crossing and derailed here on Saturday, killing six people and injuring dozens, 11 of them seriously.", "France expels more students over hijab French schools have expelled three more students for flouting the controversial ban on Islamic headscarves. The latest expulsions brought to five the total number of girls so far expelled under the new secularity ", "Racist chants BRITISH Sports Minister Richard Caborn has hit out at the racist abuse suffered by black England players during their friendly match.", "Oil Holds Firm, Heating Fuel Woes Persist  LONDON (Reuters) - Oil prices held strong above \\$53 a  barrel on Wednesday as worries over a winter supply crunch  countered expectations that high fuel costs would curb growth  in petroleum demand next year.", "In Pakistan, dead men tell no tales Pakistan #39;s establishment recently labeled Amjad Farooqi as al-Qaeda #39;s mastermind in the country. However, Asia Times Online contacts vigorously dispute this claim ... and they suspect ", "An Empire Built of Glass Designer James Carpenter understands the poetics of light and material, working with architects to enhance public places. Fourth in a series profiling this year's MacArthur 'genius award' winners. By Kari Lynn Dean.", "Blast at Russian mine kills 13 in industry's latest disaster (AFP) AFP - A blast at a Siberian mine killed 13 men in the latest disaster to strike Russia's accident-prone industry that has been chronically short of funds following the Soviet collapse.", "CalPERS, other big institutions, lean hard on Disney The California Public Employees #39; Retirement System and three other heavyweight institutions are turning up the heat on The Walt Disney Co.", "Straw welcomes Israeli poll pledge The foreign secretary, Jack Straw, today welcomed Israel #39;s announcement that it would allow international observers to monitor forthcoming Palestinian presidential elections.", "Human chips more than skin-deep Better health care and fraud protection may sound good, but are they worth the potential privacy trade-offs?", "Arab ministers avoid UN resolution on Lebanon Arab foreign ministers agreed on Tuesday to avoid a position on United Nations intervention in the Syrian-Lebanese relationship after Syria and Jordan disagreed on the right approach."], "titles": []}